Revit 2027 API
ExternalServices.BuiltInExternalServices.CloudExternalService Property
 The external service which supports get cloud model information from cloud servers such as C4R.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId CloudExternalService { get; }
Public Shared ReadOnly Property CloudExternalService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ CloudExternalService {
	ExternalServiceId^ get ();
}
static member CloudExternalService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace